//Program Size: data=10.0 xdata=0 code=105
//HexConvertVer = V22
//CheckSum = 0xBB20
//2018.10.09_V3.2

#include "Main.h"
#include <intrins.h>	

/*
1.STOP()模式下,外设和时钟都处于停止状态,ROM与RAM数据保持不变,P0/P口输入任何改变均可唤醒MCU
2.IDEL()模式下,只有Cpu的时钟源被关闭,外设与时钟发生器(IHRC 32MHz/晶振驱动器)任然正常工作,
P0/P口输入任何改变和中断时间都能唤醒MCU

若需要降低功耗,可以在进入STOP模式前将AD(ADM = 0)、PWM 等关闭,且将不使用的IO设为输出低（悬浮态会耗电）,其它IO与外部电路不能产生压差,
*/
//=====================================================================================================//
//main loop
//=====================================================================================================//
void main(void)
{
	Systeminit();
	while(1)
	{
		WDTR = 0x5a;
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();	
//进入STOP模式前,为了省电需把	AD(ADM = 0)、PWM 等关闭,且不用的IO应设为输出低(悬浮态耗电),其它IO口于外部电路不能产生压差,
		STOP();									//PCON |= 0x02;			
//唤醒之后,再将AD、PWM等打开		
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		IDLE();								//PCON |= 0x01;		
		
	}
}

//=====================================================================================================//
//System init
//=====================================================================================================//
void Systeminit(void)
{
//系统时钟寄存器,From 最大跑8M	
//====================================================================================//
	CLKSEL = 0x06;																				// Fcpu = 32M/2 = 16M
	CLKCMD = 0x69;				
	CKCON = 0x10;																					// From = 8M
	
//清看门狗
//====================================================================================//	
	WDTR = 0x5A;                   												 // clear watchdog 

//GPIO初始化,	只要P0口设置成输入状态,不需要其它任何设置,P0口就具有唤醒功能,而P1需要设置为输入模式且P1W响应位置1,该IO口才具有唤醒功能
//====================================================================================//	
	P0 = 0;
	P0M = 0;
	P0UR = 0xff;
	
	P1 = 0;
	P1M = 0;
	P1UR = 0xff;
	
	P2 = 0;
	P2M = 0;
	P2UR = 0xff;

	P1W = 0xff;														//使能P1唤醒功能
}
