//Program Size: data=9.0 xdata=0 code=99
//HexConvertVer = V22
//CheckSum = 0xC6A7
//2018.10.09_V3.2

#include "PWM.h"

//=============================================================================================================//
//main loop
//=============================================================================================================//
void main(void)
{
	Systeminit();	
	PWMinit();	
	while (1) 
	{
    WDTR = 0x5A;        // clear watchdog if watchdog enable
	}
}


void Systeminit(void)
{
//系统时钟寄存器,From 最大跑8M	
//====================================================================================//
	CLKSEL = 0x06;									// Fcpu = 32M/2 = 16M
	CLKCMD = 0x69;				
	CKCON = 0x10;										// From = 8M
	
//清看门狗
//====================================================================================//	
	WDTR = 0x5A;                    // clear watchdog 

//GPIO口初始化,当该IO口设为PWM口时,需将该IO口设置成输出模式,把上拉关闭	
//====================================================================================//	
	P0 = 0;
	P0M = 0;
	P0UR = 0xff;

	P1 = 0;
	P1M = 0;
	P1UR = 0xff;

	P2 = 0;
	P2M = 0;
	P2UR = 0xff;
	
}
